---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderRightLineStyle
source: html/9469aa6d-72a7-8cc9-8cbc-ee6712f6cac2.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderRightLineStyle Property

Indicates if the border right line style characteristic is overridden.

## Syntax (C#)
```csharp
public bool BorderRightLineStyle { get; set; }
```